dmgerman/zephyrd3/ext/hal/st/stm32cube/stm32l4xx/drivers/include/stm32l4xx_hal_conf.h
DECL|DATA_CACHE_ENABLE|macro|DATA_CACHE_ENABLE
DECL|EXTERNAL_SAI1_CLOCK_VALUE|macro|EXTERNAL_SAI1_CLOCK_VALUE
DECL|EXTERNAL_SAI2_CLOCK_VALUE|macro|EXTERNAL_SAI2_CLOCK_VALUE
DECL|HAL_ADC_MODULE_ENABLED|macro|HAL_ADC_MODULE_ENABLED
DECL|HAL_CAN_LEGACY_MODULE_ENABLED|macro|HAL_CAN_LEGACY_MODULE_ENABLED
DECL|HAL_COMP_MODULE_ENABLED|macro|HAL_COMP_MODULE_ENABLED
DECL|HAL_CORTEX_MODULE_ENABLED|macro|HAL_CORTEX_MODULE_ENABLED
DECL|HAL_CRC_MODULE_ENABLED|macro|HAL_CRC_MODULE_ENABLED
DECL|HAL_CRYP_MODULE_ENABLED|macro|HAL_CRYP_MODULE_ENABLED
DECL|HAL_DAC_MODULE_ENABLED|macro|HAL_DAC_MODULE_ENABLED
DECL|HAL_DCMI_MODULE_ENABLED|macro|HAL_DCMI_MODULE_ENABLED
DECL|HAL_DFSDM_MODULE_ENABLED|macro|HAL_DFSDM_MODULE_ENABLED
DECL|HAL_DMA2D_MODULE_ENABLED|macro|HAL_DMA2D_MODULE_ENABLED
DECL|HAL_DMA_MODULE_ENABLED|macro|HAL_DMA_MODULE_ENABLED
DECL|HAL_DSI_MODULE_ENABLED|macro|HAL_DSI_MODULE_ENABLED
DECL|HAL_FIREWALL_MODULE_ENABLED|macro|HAL_FIREWALL_MODULE_ENABLED
DECL|HAL_FLASH_MODULE_ENABLED|macro|HAL_FLASH_MODULE_ENABLED
DECL|HAL_GFXMMU_MODULE_ENABLED|macro|HAL_GFXMMU_MODULE_ENABLED
DECL|HAL_GPIO_MODULE_ENABLED|macro|HAL_GPIO_MODULE_ENABLED
DECL|HAL_HASH_MODULE_ENABLED|macro|HAL_HASH_MODULE_ENABLED
DECL|HAL_HCD_MODULE_ENABLED|macro|HAL_HCD_MODULE_ENABLED
DECL|HAL_I2C_MODULE_ENABLED|macro|HAL_I2C_MODULE_ENABLED
DECL|HAL_IRDA_MODULE_ENABLED|macro|HAL_IRDA_MODULE_ENABLED
DECL|HAL_IWDG_MODULE_ENABLED|macro|HAL_IWDG_MODULE_ENABLED
DECL|HAL_LCD_MODULE_ENABLED|macro|HAL_LCD_MODULE_ENABLED
DECL|HAL_LPTIM_MODULE_ENABLED|macro|HAL_LPTIM_MODULE_ENABLED
DECL|HAL_LTDC_MODULE_ENABLED|macro|HAL_LTDC_MODULE_ENABLED
DECL|HAL_MODULE_ENABLED|macro|HAL_MODULE_ENABLED
DECL|HAL_NAND_MODULE_ENABLED|macro|HAL_NAND_MODULE_ENABLED
DECL|HAL_NOR_MODULE_ENABLED|macro|HAL_NOR_MODULE_ENABLED
DECL|HAL_OPAMP_MODULE_ENABLED|macro|HAL_OPAMP_MODULE_ENABLED
DECL|HAL_OSPI_MODULE_ENABLED|macro|HAL_OSPI_MODULE_ENABLED
DECL|HAL_PCD_MODULE_ENABLED|macro|HAL_PCD_MODULE_ENABLED
DECL|HAL_PWR_MODULE_ENABLED|macro|HAL_PWR_MODULE_ENABLED
DECL|HAL_QSPI_MODULE_ENABLED|macro|HAL_QSPI_MODULE_ENABLED
DECL|HAL_RCC_MODULE_ENABLED|macro|HAL_RCC_MODULE_ENABLED
DECL|HAL_RNG_MODULE_ENABLED|macro|HAL_RNG_MODULE_ENABLED
DECL|HAL_RTC_MODULE_ENABLED|macro|HAL_RTC_MODULE_ENABLED
DECL|HAL_SAI_MODULE_ENABLED|macro|HAL_SAI_MODULE_ENABLED
DECL|HAL_SD_MODULE_ENABLED|macro|HAL_SD_MODULE_ENABLED
DECL|HAL_SMARTCARD_MODULE_ENABLED|macro|HAL_SMARTCARD_MODULE_ENABLED
DECL|HAL_SMBUS_MODULE_ENABLED|macro|HAL_SMBUS_MODULE_ENABLED
DECL|HAL_SPI_MODULE_ENABLED|macro|HAL_SPI_MODULE_ENABLED
DECL|HAL_SRAM_MODULE_ENABLED|macro|HAL_SRAM_MODULE_ENABLED
DECL|HAL_SWPMI_MODULE_ENABLED|macro|HAL_SWPMI_MODULE_ENABLED
DECL|HAL_TIM_MODULE_ENABLED|macro|HAL_TIM_MODULE_ENABLED
DECL|HAL_TSC_MODULE_ENABLED|macro|HAL_TSC_MODULE_ENABLED
DECL|HAL_UART_MODULE_ENABLED|macro|HAL_UART_MODULE_ENABLED
DECL|HAL_USART_MODULE_ENABLED|macro|HAL_USART_MODULE_ENABLED
DECL|HAL_WWDG_MODULE_ENABLED|macro|HAL_WWDG_MODULE_ENABLED
DECL|HSE_STARTUP_TIMEOUT|macro|HSE_STARTUP_TIMEOUT
DECL|HSE_VALUE|macro|HSE_VALUE
DECL|HSI48_VALUE|macro|HSI48_VALUE
DECL|HSI_VALUE|macro|HSI_VALUE
DECL|INSTRUCTION_CACHE_ENABLE|macro|INSTRUCTION_CACHE_ENABLE
DECL|LSE_STARTUP_TIMEOUT|macro|LSE_STARTUP_TIMEOUT
DECL|LSE_VALUE|macro|LSE_VALUE
DECL|LSI_VALUE|macro|LSI_VALUE
DECL|MSI_VALUE|macro|MSI_VALUE
DECL|PREFETCH_ENABLE|macro|PREFETCH_ENABLE
DECL|TICK_INT_PRIORITY|macro|TICK_INT_PRIORITY
DECL|USE_HAL_ADC_REGISTER_CALLBACKS|macro|USE_HAL_ADC_REGISTER_CALLBACKS
DECL|USE_HAL_CAN_REGISTER_CALLBACKS|macro|USE_HAL_CAN_REGISTER_CALLBACKS
DECL|USE_HAL_COMP_REGISTER_CALLBACKS|macro|USE_HAL_COMP_REGISTER_CALLBACKS
DECL|USE_HAL_CRYP_REGISTER_CALLBACKS|macro|USE_HAL_CRYP_REGISTER_CALLBACKS
DECL|USE_HAL_DAC_REGISTER_CALLBACKS|macro|USE_HAL_DAC_REGISTER_CALLBACKS
DECL|USE_HAL_DCMI_REGISTER_CALLBACKS|macro|USE_HAL_DCMI_REGISTER_CALLBACKS
DECL|USE_HAL_DFSDM_REGISTER_CALLBACKS|macro|USE_HAL_DFSDM_REGISTER_CALLBACKS
DECL|USE_HAL_DMA2D_REGISTER_CALLBACKS|macro|USE_HAL_DMA2D_REGISTER_CALLBACKS
DECL|USE_HAL_DSI_REGISTER_CALLBACKS|macro|USE_HAL_DSI_REGISTER_CALLBACKS
DECL|USE_HAL_GFXMMU_REGISTER_CALLBACKS|macro|USE_HAL_GFXMMU_REGISTER_CALLBACKS
DECL|USE_HAL_HASH_REGISTER_CALLBACKS|macro|USE_HAL_HASH_REGISTER_CALLBACKS
DECL|USE_HAL_HCD_REGISTER_CALLBACKS|macro|USE_HAL_HCD_REGISTER_CALLBACKS
DECL|USE_HAL_I2C_REGISTER_CALLBACKS|macro|USE_HAL_I2C_REGISTER_CALLBACKS
DECL|USE_HAL_IRDA_REGISTER_CALLBACKS|macro|USE_HAL_IRDA_REGISTER_CALLBACKS
DECL|USE_HAL_LPTIM_REGISTER_CALLBACKS|macro|USE_HAL_LPTIM_REGISTER_CALLBACKS
DECL|USE_HAL_LTDC_REGISTER_CALLBACKS|macro|USE_HAL_LTDC_REGISTER_CALLBACKS
DECL|USE_HAL_OPAMP_REGISTER_CALLBACKS|macro|USE_HAL_OPAMP_REGISTER_CALLBACKS
DECL|USE_HAL_OSPI_REGISTER_CALLBACKS|macro|USE_HAL_OSPI_REGISTER_CALLBACKS
DECL|USE_HAL_PCD_REGISTER_CALLBACKS|macro|USE_HAL_PCD_REGISTER_CALLBACKS
DECL|USE_HAL_QSPI_REGISTER_CALLBACKS|macro|USE_HAL_QSPI_REGISTER_CALLBACKS
DECL|USE_HAL_RNG_REGISTER_CALLBACKS|macro|USE_HAL_RNG_REGISTER_CALLBACKS
DECL|USE_HAL_RTC_REGISTER_CALLBACKS|macro|USE_HAL_RTC_REGISTER_CALLBACKS
DECL|USE_HAL_SAI_REGISTER_CALLBACKS|macro|USE_HAL_SAI_REGISTER_CALLBACKS
DECL|USE_HAL_SD_REGISTER_CALLBACKS|macro|USE_HAL_SD_REGISTER_CALLBACKS
DECL|USE_HAL_SMARTCARD_REGISTER_CALLBACKS|macro|USE_HAL_SMARTCARD_REGISTER_CALLBACKS
DECL|USE_HAL_SMBUS_REGISTER_CALLBACKS|macro|USE_HAL_SMBUS_REGISTER_CALLBACKS
DECL|USE_HAL_SPI_REGISTER_CALLBACKS|macro|USE_HAL_SPI_REGISTER_CALLBACKS
DECL|USE_HAL_SWPMI_REGISTER_CALLBACKS|macro|USE_HAL_SWPMI_REGISTER_CALLBACKS
DECL|USE_HAL_TIM_REGISTER_CALLBACKS|macro|USE_HAL_TIM_REGISTER_CALLBACKS
DECL|USE_HAL_TSC_REGISTER_CALLBACKS|macro|USE_HAL_TSC_REGISTER_CALLBACKS
DECL|USE_HAL_UART_REGISTER_CALLBACKS|macro|USE_HAL_UART_REGISTER_CALLBACKS
DECL|USE_HAL_USART_REGISTER_CALLBACKS|macro|USE_HAL_USART_REGISTER_CALLBACKS
DECL|USE_HAL_WWDG_REGISTER_CALLBACKS|macro|USE_HAL_WWDG_REGISTER_CALLBACKS
DECL|USE_RTOS|macro|USE_RTOS
DECL|USE_SPI_CRC|macro|USE_SPI_CRC
DECL|VDD_VALUE|macro|VDD_VALUE
DECL|__STM32L4xx_HAL_CONF_H|macro|__STM32L4xx_HAL_CONF_H
DECL|assert_param|macro|assert_param
DECL|assert_param|macro|assert_param
